def men(a):
    muj=[]
    for i in range(len(a)):
        for v in a[i].values():
            if v=='муж':
                muj.append (i+1)
                muj.append (a[i].get('Имя'))
    return muj

def Test_men():
    assert men ([{'Имя': 'Василий', 'Фамилия': 'Олегов', 'Пол': 'муж', 'Возраст': '20'},
{'Имя': 'Роберт', 'Фамилия': 'Катина', 'Пол': 'муж', 'Возраст': '30'}]) == [1,'Василий',2,'Роберт'], 'Тест провален'
    assert men ([{'Имя': 'Никита', 'Фамилия': 'Катина', 'Пол': 'жен', 'Возраст': '30'},
{'Имя': 'Болт', 'Фамилия': 'Олегов', 'Пол': 'муж', 'Возраст': '20'},
{'Имя': 'Ника', 'Фамилия': 'Катина', 'Пол': 'жен', 'Возраст': '30'}]) == [2,'Болт'], 'Тест провален'